#### 📖 Terraform Plan ('src/core/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
urerm_private_dns_zone_virtual_network_link" "redis_private_vnet" {
      + id                    = (known after apply)
      + name                  = "io-p-redis-common-common"
      + private_dns_zone_name = "privatelink.redis.cache.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "io-p-rg-common"
      + tags                  = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.dns_weu.azurerm_private_dns_zone_virtual_network_link.servicebus_private_vnet["beta"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "servicebus_private_vnet" {
      + id                    = (known after apply)
      + name                  = "io-p-weu-beta-vnet"
      + private_dns_zone_name = "privatelink.servicebus.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "io-p-evt-rg"
      + tags                  = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
      + virtual_network_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-weu-beta-vnet-rg/providers/Microsoft.Network/virtualNetworks/io-p-weu-beta-vnet"
    }

  # module.dns_weu.azurerm_private_dns_zone_virtual_network_link.servicebus_private_vnet["itn"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "servicebus_private_vnet" {
      + id                    = (known after apply)
      + name                  = "io-p-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.servicebus.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "io-p-evt-rg"
      + tags                  = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.dns_weu.azurerm_private_dns_zone_virtual_network_link.servicebus_private_vnet["prod01"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "servicebus_private_vnet" {
      + id                    = (known after apply)
      + name                  = "io-p-weu-prod01-vnet"
      + private_dns_zone_name = "privatelink.servicebus.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "io-p-evt-rg"
      + tags                  = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
      + virtual_network_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-weu-prod01-vnet-rg/providers/Microsoft.Network/virtualNetworks/io-p-weu-prod01-vnet"
    }

  # module.dns_weu.azurerm_private_dns_zone_virtual_network_link.servicebus_private_vnet["weu"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "servicebus_private_vnet" {
      + id                    = (known after apply)
      + name                  = "io-p-evh-ns-private-dns-zone-link-01"
      + private_dns_zone_name = "privatelink.servicebus.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "io-p-evt-rg"
      + tags                  = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.dns_weu.azurerm_private_dns_zone_virtual_network_link.srch_private_vnet_common["itn"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "srch_private_vnet_common" {
      + id                    = (known after apply)
      + name                  = "io-p-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.search.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "io-p-rg-common"
      + tags                  = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.dns_weu.azurerm_private_dns_zone_virtual_network_link.srch_private_vnet_common["weu"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "srch_private_vnet_common" {
      + id                    = (known after apply)
      + name                  = "io-p-vnet-common"
      + private_dns_zone_name = "privatelink.search.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "io-p-rg-common"
      + tags                  = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.dns_weu.azurerm_private_dns_zone_virtual_network_link.table_core_private_vnet["beta"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "table_core_private_vnet" {
      + id                    = (known after apply)
      + name                  = "io-p-weu-beta-vnet"
      + private_dns_zone_name = "privatelink.table.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "io-p-rg-common"
      + tags                  = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
      + virtual_network_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-weu-beta-vnet-rg/providers/Microsoft.Network/virtualNetworks/io-p-weu-beta-vnet"
    }

  # module.dns_weu.azurerm_private_dns_zone_virtual_network_link.table_core_private_vnet["itn"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "table_core_private_vnet" {
      + id                    = (known after apply)
      + name                  = "io-p-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.table.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "io-p-rg-common"
      + tags                  = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.dns_weu.azurerm_private_dns_zone_virtual_network_link.table_core_private_vnet["prod01"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "table_core_private_vnet" {
      + id                    = (known after apply)
      + name                  = "io-p-weu-prod01-vnet"
      + private_dns_zone_name = "privatelink.table.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "io-p-rg-common"
      + tags                  = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
      + virtual_network_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-weu-prod01-vnet-rg/providers/Microsoft.Network/virtualNetworks/io-p-weu-prod01-vnet"
    }

  # module.dns_weu.azurerm_private_dns_zone_virtual_network_link.table_core_private_vnet["weu"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "table_core_private_vnet" {
      + id                    = (known after apply)
      + name                  = "io-p-vnet-common"
      + private_dns_zone_name = "privatelink.table.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "io-p-rg-common"
      + tags                  = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.networking.azurerm_nat_gateway.this will be destroyed
  # (because azurerm_nat_gateway.this is not in configuration)
  - resource "azurerm_nat_gateway" "this" {
      - id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/natGateways/io-p-itn-ng-01" -> null
      - idle_timeout_in_minutes = 4 -> null
      - location                = "italynorth" -> null
      - name                    = "io-p-itn-ng-01" -> null
      - resource_group_name     = "io-p-itn-common-rg-01" -> null
      - resource_guid           = "d78b2e3a-f2f2-40a6-9158-501221bbd3d6" -> null
      - sku_name                = "Standard" -> null
      - tags                    = {
          - "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"   = "Terraform"
          - "Environment" = "Prod"
          - "Owner"       = "IO"
          - "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod/italynorth"
        } -> null
      - zones                   = [
          - "1",
        ] -> null
    }

  # module.networking.azurerm_nat_gateway_public_ip_association.this_pip_01 will be destroyed
  # (because azurerm_nat_gateway_public_ip_association.this_pip_01 is not in configuration)
  - resource "azurerm_nat_gateway_public_ip_association" "this_pip_01" {
      - id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/natGateways/io-p-itn-ng-01|/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/publicIPAddresses/io-p-itn-ng-pip-01" -> null
      - nat_gateway_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/natGateways/io-p-itn-ng-01" -> null
      - public_ip_address_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/publicIPAddresses/io-p-itn-ng-pip-01" -> null
    }

  # module.networking.azurerm_private_dns_zone_virtual_network_link.azurewebsites_private_vnet_itn_common will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.azurewebsites_private_vnet_itn_common is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "azurewebsites_private_vnet_itn_common" {
      - id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net/virtualNetworkLinks/io-p-itn-common-vnet-01" -> null
      - name                  = "io-p-itn-common-vnet-01" -> null
      - private_dns_zone_name = "privatelink.azurewebsites.net" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "io-p-rg-common" -> null
      - tags                  = {
          - "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"   = "Terraform"
          - "Environment" = "Prod"
          - "Owner"       = "IO"
          - "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod/italynorth"
        } -> null
      - virtual_network_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01" -> null
    }

  # module.networking.azurerm_private_dns_zone_virtual_network_link.blob_core_private_vnet_itn_common will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.blob_core_private_vnet_itn_common is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "blob_core_private_vnet_itn_common" {
      - id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net/virtualNetworkLinks/io-p-itn-common-vnet-01" -> null
      - name                  = "io-p-itn-common-vnet-01" -> null
      - private_dns_zone_name = "privatelink.blob.core.windows.net" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "io-p-rg-common" -> null
      - tags                  = {
          - "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"   = "Terraform"
          - "Environment" = "Prod"
          - "Owner"       = "IO"
          - "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod/italynorth"
        } -> null
      - virtual_network_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01" -> null
    }

  # module.networking.azurerm_private_dns_zone_virtual_network_link.documents_private_vnet_itn_common will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.documents_private_vnet_itn_common is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "documents_private_vnet_itn_common" {
      - id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.documents.azure.com/virtualNetworkLinks/io-p-itn-common-vnet-01" -> null
      - name                  = "io-p-itn-common-vnet-01" -> null
      - private_dns_zone_name = "privatelink.documents.azure.com" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "io-p-rg-common" -> null
      - tags                  = {
          - "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"   = "Terraform"
          - "Environment" = "Prod"
          - "Owner"       = "IO"
          - "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod/italynorth"
        } -> null
      - virtual_network_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01" -> null
    }

  # module.networking.azurerm_private_dns_zone_virtual_network_link.file_core_private_vnet_itn_common will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.file_core_private_vnet_itn_common is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "file_core_private_vnet_itn_common" {
      - id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.file.core.windows.net/virtualNetworkLinks/io-p-itn-common-vnet-01" -> null
      - name                  = "io-p-itn-common-vnet-01" -> null
      - private_dns_zone_name = "privatelink.file.core.windows.net" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "io-p-rg-common" -> null
      - tags                  = {
          - "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"   = "Terraform"
          - "Environment" = "Prod"
          - "Owner"       = "IO"
          - "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod/italynorth"
        } -> null
      - virtual_network_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01" -> null
    }

  # module.networking.azurerm_private_dns_zone_virtual_network_link.internal_io_pagopa_it_private_vnet_itn_common will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.internal_io_pagopa_it_private_vnet_itn_common is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "internal_io_pagopa_it_private_vnet_itn_common" {
      - id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.Network/privateDnsZones/internal.io.pagopa.it/virtualNetworkLinks/io-p-itn-common-vnet-01" -> null
      - name                  = "io-p-itn-common-vnet-01" -> null
      - private_dns_zone_name = "internal.io.pagopa.it" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "io-p-rg-internal" -> null
      - tags                  = {
          - "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"   = "Terraform"
          - "Environment" = "Prod"
          - "Owner"       = "IO"
          - "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod/italynorth"
        } -> null
      - virtual_network_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01" -> null
    }

  # module.networking.azurerm_private_dns_zone_virtual_network_link.mongo_cosmos_private_vnet_itn_common will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.mongo_cosmos_private_vnet_itn_common is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "mongo_cosmos_private_vnet_itn_common" {
      - id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.mongo.cosmos.azure.com/virtualNetworkLinks/io-p-itn-common-vnet-01" -> null
      - name                  = "io-p-itn-common-vnet-01" -> null
      - private_dns_zone_name = "privatelink.mongo.cosmos.azure.com" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "io-p-rg-common" -> null
      - tags                  = {
          - "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"   = "Terraform"
          - "Environment" = "Prod"
          - "Owner"       = "IO"
          - "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod/italynorth"
        } -> null
      - virtual_network_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01" -> null
    }

  # module.networking.azurerm_private_dns_zone_virtual_network_link.privatelink_postgres_database_azure_com_vnet_itn_common will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.privatelink_postgres_database_azure_com_vnet_itn_common is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "privatelink_postgres_database_azure_com_vnet_itn_common" {
      - id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com/virtualNetworkLinks/io-p-itn-common-vnet-01" -> null
      - name                  = "io-p-itn-common-vnet-01" -> null
      - private_dns_zone_name = "privatelink.postgres.database.azure.com" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "io-p-rg-common" -> null
      - tags                  = {
          - "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"   = "Terraform"
          - "Environment" = "Prod"
          - "Owner"       = "IO"
          - "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod/italynorth"
        } -> null
      - virtual_network_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01" -> null
    }

  # module.networking.azurerm_private_dns_zone_virtual_network_link.queue_core_private_vnet_itn_common will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.queue_core_private_vnet_itn_common is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "queue_core_private_vnet_itn_common" {
      - id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net/virtualNetworkLinks/io-p-itn-common-vnet-01" -> null
      - name                  = "io-p-itn-common-vnet-01" -> null
      - private_dns_zone_name = "privatelink.queue.core.windows.net" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "io-p-rg-common" -> null
      - tags                  = {
          - "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"   = "Terraform"
          - "Environment" = "Prod"
          - "Owner"       = "IO"
          - "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod/italynorth"
        } -> null
      - virtual_network_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01" -> null
    }

  # module.networking.azurerm_private_dns_zone_virtual_network_link.servicebus_private_vnet_itn_common will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.servicebus_private_vnet_itn_common is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "servicebus_private_vnet_itn_common" {
      - id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-evt-rg/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net/virtualNetworkLinks/io-p-itn-common-vnet-01" -> null
      - name                  = "io-p-itn-common-vnet-01" -> null
      - private_dns_zone_name = "privatelink.servicebus.windows.net" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "io-p-evt-rg" -> null
      - tags                  = {
          - "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"   = "Terraform"
          - "Environment" = "Prod"
          - "Owner"       = "IO"
          - "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod/italynorth"
        } -> null
      - virtual_network_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01" -> null
    }

  # module.networking.azurerm_private_dns_zone_virtual_network_link.srch_private_vnet_itn_common will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.srch_private_vnet_itn_common is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "srch_private_vnet_itn_common" {
      - id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.search.windows.net/virtualNetworkLinks/io-p-itn-common-vnet-01" -> null
      - name                  = "io-p-itn-common-vnet-01" -> null
      - private_dns_zone_name = "privatelink.search.windows.net" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "io-p-rg-common" -> null
      - tags                  = {
          - "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"   = "Terraform"
          - "Environment" = "Prod"
          - "Owner"       = "IO"
          - "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod/italynorth"
        } -> null
      - virtual_network_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01" -> null
    }

  # module.networking.azurerm_private_dns_zone_virtual_network_link.table_core_private_vnet_itn_common will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.table_core_private_vnet_itn_common is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "table_core_private_vnet_itn_common" {
      - id                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.table.core.windows.net/virtualNetworkLinks/io-p-itn-common-vnet-01" -> null
      - name                  = "io-p-itn-common-vnet-01" -> null
      - private_dns_zone_name = "privatelink.table.core.windows.net" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "io-p-rg-common" -> null
      - tags                  = {
          - "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"   = "Terraform"
          - "Environment" = "Prod"
          - "Owner"       = "IO"
          - "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod/italynorth"
        } -> null
      - virtual_network_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01" -> null
    }

  # module.networking.azurerm_public_ip.this_01 will be destroyed
  # (because azurerm_public_ip.this_01 is not in configuration)
  - resource "azurerm_public_ip" "this_01" {
      - allocation_method       = "Static" -> null
      - ddos_protection_mode    = "VirtualNetworkInherited" -> null
      - id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/publicIPAddresses/io-p-itn-ng-pip-01" -> null
      - idle_timeout_in_minutes = 4 -> null
      - ip_address              = "4.232.130.16" -> null
      - ip_tags                 = {} -> null
      - ip_version              = "IPv4" -> null
      - location                = "italynorth" -> null
      - name                    = "io-p-itn-ng-pip-01" -> null
      - resource_group_name     = "io-p-itn-common-rg-01" -> null
      - sku                     = "Standard" -> null
      - sku_tier                = "Regional" -> null
      - tags                    = {
          - "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"   = "Terraform"
          - "Environment" = "Prod"
          - "Owner"       = "IO"
          - "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod/italynorth"
        } -> null
      - zones                   = [
          - "1",
        ] -> null
    }

  # module.networking_itn.azurerm_nat_gateway.this will be created
  + resource "azurerm_nat_gateway" "this" {
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + location                = "italynorth"
      + name                    = "io-p-itn-ng-01"
      + resource_group_name     = "io-p-itn-common-rg-01"
      + resource_guid           = (known after apply)
      + sku_name                = "Standard"
      + tags                    = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
      + zones                   = [
          + "1",
        ]
    }

  # module.networking_itn.azurerm_nat_gateway_public_ip_association.this_pip_01[0] will be created
  + resource "azurerm_nat_gateway_public_ip_association" "this_pip_01" {
      + id                   = (known after apply)
      + nat_gateway_id       = (known after apply)
      + public_ip_address_id = (known after apply)
    }

  # module.networking_itn.azurerm_public_ip.this_01[0] will be created
  + resource "azurerm_public_ip" "this_01" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "italynorth"
      + name                    = "io-p-itn-ng-pip-01"
      + resource_group_name     = "io-p-itn-common-rg-01"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
      + zones                   = [
          + "1",
        ]
    }

  # module.networking_weu.azurerm_nat_gateway.this will be created
  + resource "azurerm_nat_gateway" "this" {
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + location                = "westeurope"
      + name                    = "io-p-natgw"
      + resource_group_name     = "io-p-rg-common"
      + resource_guid           = (known after apply)
      + sku_name                = "Standard"
      + tags                    = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
      + zones                   = [
          + "1",
        ]
    }

  # module.networking_weu.azurerm_nat_gateway_public_ip_association.this_pip_01[0] will be created
  + resource "azurerm_nat_gateway_public_ip_association" "this_pip_01" {
      + id                   = (known after apply)
      + nat_gateway_id       = (known after apply)
      + public_ip_address_id = (known after apply)
    }

  # module.networking_weu.azurerm_nat_gateway_public_ip_association.this_pip_01[1] will be created
  + resource "azurerm_nat_gateway_public_ip_association" "this_pip_01" {
      + id                   = (known after apply)
      + nat_gateway_id       = (known after apply)
      + public_ip_address_id = (known after apply)
    }

  # module.networking_weu.azurerm_public_ip.this_01[0] will be created
  + resource "azurerm_public_ip" "this_01" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westeurope"
      + name                    = "io-p-natgw-01"
      + resource_group_name     = "io-p-rg-common"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
      + zones                   = [
          + "1",
        ]
    }

  # module.networking_weu.azurerm_public_ip.this_01[1] will be created
  + resource "azurerm_public_ip" "this_01" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westeurope"
      + name                    = "io-p-natgw-02"
      + resource_group_name     = "io-p-rg-common"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
      + zones                   = [
          + "1",
        ]
    }

  # module.networking.module.pep_snet.azurerm_subnet.this will be destroyed
  # (because azurerm_subnet.this is not in configuration)
  - resource "azurerm_subnet" "this" {
      - address_prefixes                               = [
          - "10.20.2.0/23",
        ] -> null
      - enforce_private_link_endpoint_network_policies = true -> null
      - enforce_private_link_service_network_policies  = false -> null
      - id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01" -> null
      - name                                           = "io-p-itn-pep-snet-01" -> null
      - private_endpoint_network_policies_enabled      = false -> null
      - private_link_service_network_policies_enabled  = true -> null
      - resource_group_name                            = "io-p-itn-common-rg-01" -> null
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      - virtual_network_name                           = "io-p-itn-common-vnet-01" -> null
    }

  # module.networking.module.vnet_itn_common.azurerm_virtual_network.this will be destroyed
  # (because azurerm_virtual_network.this is not in configuration)
  - resource "azurerm_virtual_network" "this" {
      - address_space           = [
          - "10.20.0.0/16",
        ] -> null
      - dns_servers             = [] -> null
      - flow_timeout_in_minutes = 0 -> null
      - guid                    = "5982b584-a39e-4e65-8c6a-f158de00f28f" -> null
      - id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01" -> null
      - location                = "italynorth" -> null
      - name                    = "io-p-itn-common-vnet-01" -> null
      - resource_group_name     = "io-p-itn-common-rg-01" -> null
      - subnet                  = [
          - {
              - address_prefix = "10.20.0.0/24"
              - id             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-wallet-user-func-snet-01"
              - name           = "io-p-itn-wallet-user-func-snet-01"
              - security_group = ""
            },
          - {
              - address_prefix = "10.20.1.0/24"
              - id             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-msgs-sending-func-snet-01"
              - name           = "io-p-itn-msgs-sending-func-snet-01"
              - security_group = ""
            },
          - {
              - address_prefix = "10.20.2.0/23"
              - id             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
              - name           = "io-p-itn-pep-snet-01"
              - security_group = ""
            },
          - {
              - address_prefix = "10.20.4.0/26"
              - id             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-svc-srch-snet-01"
              - name           = "io-p-itn-svc-srch-snet-01"
              - security_group = ""
            },
          - {
              - address_prefix = "10.20.5.0/24"
              - id             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-svc-app-be-func-snet-01"
              - name           = "io-p-itn-svc-app-be-func-snet-01"
              - security_group = ""
            },
          - {
              - address_prefix = "10.20.6.0/26"
              - id             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-lollipop-snet-01"
              - name           = "io-p-itn-lollipop-snet-01"
              - security_group = ""
            },
          - {
              - address_prefix = "10.20.7.0/27"
              - id             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-sm-p-itn-onboarding-snet-01"
              - name           = "io-sm-p-itn-onboarding-snet-01"
              - security_group = ""
            },
          - {
              - address_prefix = "10.20.8.0/26"
              - id             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-msgs-notif-func-snet-02"
              - name           = "io-p-itn-msgs-notif-func-snet-02"
              - security_group = ""
            },
        ] -> null
      - tags                    = {
          - "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"   = "Terraform"
          - "Environment" = "Prod"
          - "Owner"       = "IO"
          - "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod/italynorth"
        } -> null

      - ddos_protection_plan {
          - enable = true -> null
          - id     = "/subscriptions/0da48c97-355f-4050-a520-f11a18b8be90/resourceGroups/sec-p-ddos/providers/Microsoft.Network/ddosProtectionPlans/sec-p-ddos-protection" -> null
        }
    }

  # module.networking.module.vnet_peering_itn_common_weu_beta.azurerm_virtual_network_peering.source will be destroyed
  # (because azurerm_virtual_network_peering.source is not in configuration)
  - resource "azurerm_virtual_network_peering" "source" {
      - allow_forwarded_traffic      = false -> null
      - allow_gateway_transit        = false -> null
      - allow_virtual_network_access = true -> null
      - id                           = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/virtualNetworkPeerings/io-p-itn-common-vnet-01-to-io-p-weu-beta-vnet" -> null
      - name                         = "io-p-itn-common-vnet-01-to-io-p-weu-beta-vnet" -> null
      - remote_virtual_network_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-weu-beta-vnet-rg/providers/Microsoft.Network/virtualNetworks/io-p-weu-beta-vnet" -> null
      - resource_group_name          = "io-p-itn-common-rg-01" -> null
      - use_remote_gateways          = false -> null
      - virtual_network_name         = "io-p-itn-common-vnet-01" -> null
    }

  # module.networking.module.vnet_peering_itn_common_weu_beta.azurerm_virtual_network_peering.target will be destroyed
  # (because azurerm_virtual_network_peering.target is not in configuration)
  - resource "azurerm_virtual_network_peering" "target" {
      - allow_forwarded_traffic      = false -> null
      - allow_gateway_transit        = false -> null
      - allow_virtual_network_access = true -> null
      - id                           = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-weu-beta-vnet-rg/providers/Microsoft.Network/virtualNetworks/io-p-weu-beta-vnet/virtualNetworkPeerings/io-p-weu-beta-vnet-to-io-p-itn-common-vnet-01" -> null
      - name                         = "io-p-weu-beta-vnet-to-io-p-itn-common-vnet-01" -> null
      - remote_virtual_network_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01" -> null
      - resource_group_name          = "io-p-weu-beta-vnet-rg" -> null
      - use_remote_gateways          = false -> null
      - virtual_network_name         = "io-p-weu-beta-vnet" -> null
    }

  # module.networking.module.vnet_peering_itn_common_weu_prod01.azurerm_virtual_network_peering.source will be destroyed
  # (because azurerm_virtual_network_peering.source is not in configuration)
  - resource "azurerm_virtual_network_peering" "source" {
      - allow_forwarded_traffic      = false -> null
      - allow_gateway_transit        = false -> null
      - allow_virtual_network_access = true -> null
      - id                           = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/virtualNetworkPeerings/io-p-itn-common-vnet-01-to-io-p-weu-prod01-vnet" -> null
      - name                         = "io-p-itn-common-vnet-01-to-io-p-weu-prod01-vnet" -> null
      - remote_virtual_network_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-weu-prod01-vnet-rg/providers/Microsoft.Network/virtualNetworks/io-p-weu-prod01-vnet" -> null
      - resource_group_name          = "io-p-itn-common-rg-01" -> null
      - use_remote_gateways          = false -> null
      - virtual_network_name         = "io-p-itn-common-vnet-01" -> null
    }

  # module.networking.module.vnet_peering_itn_common_weu_prod01.azurerm_virtual_network_peering.target will be destroyed
  # (because azurerm_virtual_network_peering.target is not in configuration)
  - resource "azurerm_virtual_network_peering" "target" {
      - allow_forwarded_traffic      = false -> null
      - allow_gateway_transit        = false -> null
      - allow_virtual_network_access = true -> null
      - id                           = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-weu-prod01-vnet-rg/providers/Microsoft.Network/virtualNetworks/io-p-weu-prod01-vnet/virtualNetworkPeerings/io-p-weu-prod01-vnet-to-io-p-itn-common-vnet-01" -> null
      - name                         = "io-p-weu-prod01-vnet-to-io-p-itn-common-vnet-01" -> null
      - remote_virtual_network_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01" -> null
      - resource_group_name          = "io-p-weu-prod01-vnet-rg" -> null
      - use_remote_gateways          = false -> null
      - virtual_network_name         = "io-p-weu-prod01-vnet" -> null
    }

  # module.networking.module.vnet_peering_weu_common_itn_common.azurerm_virtual_network_peering.source will be destroyed
  # (because azurerm_virtual_network_peering.source is not in configuration)
  - resource "azurerm_virtual_network_peering" "source" {
      - allow_forwarded_traffic      = false -> null
      - allow_gateway_transit        = true -> null
      - allow_virtual_network_access = true -> null
      - id                           = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common/virtualNetworkPeerings/io-p-vnet-common-to-io-p-itn-common-vnet-01" -> null
      - name                         = "io-p-vnet-common-to-io-p-itn-common-vnet-01" -> null
      - remote_virtual_network_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01" -> null
      - resource_group_name          = "io-p-rg-common" -> null
      - use_remote_gateways          = false -> null
      - virtual_network_name         = "io-p-vnet-common" -> null
    }

  # module.networking.module.vnet_peering_weu_common_itn_common.azurerm_virtual_network_peering.target will be destroyed
  # (because azurerm_virtual_network_peering.target is not in configuration)
  - resource "azurerm_virtual_network_peering" "target" {
      - allow_forwarded_traffic      = false -> null
      - allow_gateway_transit        = false -> null
      - allow_virtual_network_access = true -> null
      - id                           = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/virtualNetworkPeerings/io-p-itn-common-vnet-01-to-io-p-vnet-common" -> null
      - name                         = "io-p-itn-common-vnet-01-to-io-p-vnet-common" -> null
      - remote_virtual_network_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworks/io-p-vnet-common" -> null
      - resource_group_name          = "io-p-itn-common-rg-01" -> null
      - use_remote_gateways          = true -> null
      - virtual_network_name         = "io-p-itn-common-vnet-01" -> null
    }

  # module.networking_itn.module.pep_snet.azurerm_subnet.this will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "10.20.2.0/23",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "io-p-itn-pep-snet-01"
      + private_endpoint_network_policies_enabled      = false
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "io-p-itn-common-rg-01"
      + virtual_network_name                           = "io-p-itn-common-vnet-01"
    }

  # module.networking_itn.module.vnet_common.azurerm_virtual_network.this will be created
  + resource "azurerm_virtual_network" "this" {
      + address_space       = [
          + "10.20.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-p-itn-common-vnet-01"
      + resource_group_name = "io-p-itn-common-rg-01"
      + subnet              = (known after apply)
      + tags                = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }

      + ddos_protection_plan {
          + enable = true
          + id     = "/subscriptions/0da48c97-355f-4050-a520-f11a18b8be90/resourceGroups/sec-p-ddos/providers/Microsoft.Network/ddosProtectionPlans/sec-p-ddos-protection"
        }
    }

  # module.networking_weu.module.pep_snet.azurerm_subnet.this will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                               = [
          + "10.0.240.0/23",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "pendpoints"
      + private_endpoint_network_policies_enabled      = false
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "io-p-rg-common"
      + virtual_network_name                           = "io-p-vnet-common"
    }

  # module.networking_weu.module.vnet_common.azurerm_virtual_network.this will be created
  + resource "azurerm_virtual_network" "this" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "io-p-vnet-common"
      + resource_group_name = "io-p-rg-common"
      + subnet              = (known after apply)
      + tags                = {
          + "CostCenter"  = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"   = "Terraform"
          + "Environment" = "Prod"
          + "Owner"       = "IO"
          + "Source"      = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }

      + ddos_protection_plan {
          + enable = true
          + id     = "/subscriptions/0da48c97-355f-4050-a520-f11a18b8be90/resourceGroups/sec-p-ddos/providers/Microsoft.Network/ddosProtectionPlans/sec-p-ddos-protection"
        }
    }

  # module.vnet_peering_itn.module.vnet_peering["beta"].azurerm_virtual_network_peering.source will be created
  + resource "azurerm_virtual_network_peering" "source" {
      + allow_forwarded_traffic      = false
      + allow_gateway_transit        = true
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "io-p-itn-common-vnet-01-to-io-p-weu-beta-vnet"
      + remote_virtual_network_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-weu-beta-vnet-rg/providers/Microsoft.Network/virtualNetworks/io-p-weu-beta-vnet"
      + resource_group_name          = "io-p-itn-common-rg-01"
      + use_remote_gateways          = false
      + virtual_network_name         = "io-p-itn-common-vnet-01"
    }

  # module.vnet_peering_itn.module.vnet_peering["beta"].azurerm_virtual_network_peering.target will be created
  + resource "azurerm_virtual_network_peering" "target" {
      + allow_forwarded_traffic      = false
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "io-p-weu-beta-vnet-to-io-p-itn-common-vnet-01"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "io-p-weu-beta-vnet-rg"
      + use_remote_gateways          = false
      + virtual_network_name         = "io-p-weu-beta-vnet"
    }

  # module.vnet_peering_itn.module.vnet_peering["prod01"].azurerm_virtual_network_peering.source will be created
  + resource "azurerm_virtual_network_peering" "source" {
      + allow_forwarded_traffic      = false
      + allow_gateway_transit        = true
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "io-p-itn-common-vnet-01-to-io-p-weu-prod01-vnet"
      + remote_virtual_network_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-weu-prod01-vnet-rg/providers/Microsoft.Network/virtualNetworks/io-p-weu-prod01-vnet"
      + resource_group_name          = "io-p-itn-common-rg-01"
      + use_remote_gateways          = false
      + virtual_network_name         = "io-p-itn-common-vnet-01"
    }

  # module.vnet_peering_itn.module.vnet_peering["prod01"].azurerm_virtual_network_peering.target will be created
  + resource "azurerm_virtual_network_peering" "target" {
      + allow_forwarded_traffic      = false
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "io-p-weu-prod01-vnet-to-io-p-itn-common-vnet-01"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "io-p-weu-prod01-vnet-rg"
      + use_remote_gateways          = false
      + virtual_network_name         = "io-p-weu-prod01-vnet"
    }

  # module.vnet_peering_itn.module.vnet_peering["weu"].azurerm_virtual_network_peering.source will be created
  + resource "azurerm_virtual_network_peering" "source" {
      + allow_forwarded_traffic      = false
      + allow_gateway_transit        = true
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "io-p-itn-common-vnet-01-to-io-p-vnet-common"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "io-p-itn-common-rg-01"
      + use_remote_gateways          = false
      + virtual_network_name         = "io-p-itn-common-vnet-01"
    }

  # module.vnet_peering_itn.module.vnet_peering["weu"].azurerm_virtual_network_peering.target will be created
  + resource "azurerm_virtual_network_peering" "target" {
      + allow_forwarded_traffic      = false
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "io-p-vnet-common-to-io-p-itn-common-vnet-01"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "io-p-rg-common"
      + use_remote_gateways          = false
      + virtual_network_name         = "io-p-vnet-common"
    }

  # module.vnet_peering_weu.module.vnet_peering["beta"].azurerm_virtual_network_peering.source will be created
  + resource "azurerm_virtual_network_peering" "source" {
      + allow_forwarded_traffic      = false
      + allow_gateway_transit        = true
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "io-p-vnet-common-to-io-p-weu-beta-vnet"
      + remote_virtual_network_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-weu-beta-vnet-rg/providers/Microsoft.Network/virtualNetworks/io-p-weu-beta-vnet"
      + resource_group_name          = "io-p-rg-common"
      + use_remote_gateways          = false
      + virtual_network_name         = "io-p-vnet-common"
    }

  # module.vnet_peering_weu.module.vnet_peering["beta"].azurerm_virtual_network_peering.target will be created
  + resource "azurerm_virtual_network_peering" "target" {
      + allow_forwarded_traffic      = false
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "io-p-weu-beta-vnet-to-io-p-vnet-common"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "io-p-weu-beta-vnet-rg"
      + use_remote_gateways          = true
      + virtual_network_name         = "io-p-weu-beta-vnet"
    }

  # module.vnet_peering_weu.module.vnet_peering["itn"].azurerm_virtual_network_peering.source will be created
  + resource "azurerm_virtual_network_peering" "source" {
      + allow_forwarded_traffic      = false
      + allow_gateway_transit        = true
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "io-p-vnet-common-to-io-p-itn-common-vnet-01"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "io-p-rg-common"
      + use_remote_gateways          = false
      + virtual_network_name         = "io-p-vnet-common"
    }

  # module.vnet_peering_weu.module.vnet_peering["itn"].azurerm_virtual_network_peering.target will be created
  + resource "azurerm_virtual_network_peering" "target" {
      + allow_forwarded_traffic      = false
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "io-p-itn-common-vnet-01-to-io-p-vnet-common"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "io-p-itn-common-rg-01"
      + use_remote_gateways          = true
      + virtual_network_name         = "io-p-itn-common-vnet-01"
    }

  # module.vnet_peering_weu.module.vnet_peering["prod01"].azurerm_virtual_network_peering.source will be created
  + resource "azurerm_virtual_network_peering" "source" {
      + allow_forwarded_traffic      = false
      + allow_gateway_transit        = true
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "io-p-vnet-common-to-io-p-weu-prod01-vnet"
      + remote_virtual_network_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-weu-prod01-vnet-rg/providers/Microsoft.Network/virtualNetworks/io-p-weu-prod01-vnet"
      + resource_group_name          = "io-p-rg-common"
      + use_remote_gateways          = false
      + virtual_network_name         = "io-p-vnet-common"
    }

  # module.vnet_peering_weu.module.vnet_peering["prod01"].azurerm_virtual_network_peering.target will be created
  + resource "azurerm_virtual_network_peering" "target" {
      + allow_forwarded_traffic      = false
      + allow_gateway_transit        = false
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "io-p-weu-prod01-vnet-to-io-p-vnet-common"
      + remote_virtual_network_id    = (known after apply)
      + resource_group_name          = "io-p-weu-prod01-vnet-rg"
      + use_remote_gateways          = true
      + virtual_network_name         = "io-p-weu-prod01-vnet"
    }

Plan: 121 to add, 1 to change, 22 to destroy.

Changes to Outputs:
  + networking_itn  = {
      + name = "io-p-itn-common-vnet-01"
    }
  + networking_weu  = {
      + name = "io-p-vnet-common"
    }
  - vnet_itn_common = {
      - name = "io-p-itn-common-vnet-01"
    } -> null

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
